package com.rprtr258;

/*
* Реализовать класс для работы с хеш-таблицей (на списках).
* Общение с пользователем должно происходит в интерактивном режиме:
* добавить значение в хеш-таблицу, удалить значение из хеш-таблицы,
* поиск значения в хеш-таблице, показать статистику по хеш-таблице
* (общее число ячеек, load factor, число конфликтов, максимальная длина
* списка в конфликтных ячейках и т.п.), заполнить хеш-таблицу содержимым файла,
* выбрать хеш-функцию для подсчета хеша (из заранее заданных в коде).
* Смена хэш-функции должна происходить во время работы программы,
* в класс используемая хеш-функция должна передаваться из клиентского кода.
* */

public class Main {
    public static void main(String[] args) {

    }
}
